OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x7.h
/******************  Bit definition for ADC_SEQR1 register  ********************/
#define ADC_SEQR1_SQ8_Pos         (0U)
#define ADC_SEQR1_SQ8_Msk         (0xFUL << ADC_SEQR1_SQ8_Pos)                  /*!< 0x0000000F */
#define ADC_SEQR1_SQ8              ADC_SEQR1_SQ8_Msk                            /*!< ADC sequence select */
#define ADC_SEQR1_SQ8_0           (0x1UL << ADC_SEQR1_SQ8_Pos)                  /*!< 0x00000001 */
#define ADC_SEQR1_SQ8_1           (0x2UL << ADC_SEQR1_SQ8_Pos)                  /*!< 0x00000002 */
#define ADC_SEQR1_SQ8_2           (0x4UL << ADC_SEQR1_SQ8_Pos)                  /*!< 0x00000004 */
#define ADC_SEQR1_SQ8_4           (0x8UL << ADC_SEQR1_SQ8_Pos)                  /*!< 0x00000008 */
#define ADC_SEQR1_SQ9_Pos         (4U)
#define ADC_SEQR1_SQ9_Msk         (0xFUL << ADC_SEQR1_SQ9_Pos)                  /*!< 0x000000F0 */
#define ADC_SEQR1_SQ9              ADC_SEQR1_SQ9_Msk                            /*!< ADC sequence select */
#define ADC_SEQR1_SQ9_0           (0x1UL << ADC_SEQR1_SQ9_Pos)                  /*!< 0x00000010 */
#define ADC_SEQR1_SQ9_1           (0x2UL << ADC_SEQR1_SQ9_Pos)                  /*!< 0x00000020 */
#define ADC_SEQR1_SQ9_2           (0x4UL << ADC_SEQR1_SQ9_Pos)                  /*!< 0x00000040 */
#define ADC_SEQR1_SQ9_4           (0x8UL << ADC_SEQR1_SQ9_Pos)                  /*!< 0x00000080 */
#define ADC_SEQR1_SQ10_Pos        (8U)
#define ADC_SEQR1_SQ10_Msk        (0xFUL << ADC_SEQR1_SQ10_Pos)                 /*!< 0x00000F00 */
#define ADC_SEQR1_SQ10             ADC_SEQR1_SQ10_Msk                           /*!< ADC sequence select */
#define ADC_SEQR1_SQ10_0          (0x1UL << ADC_SEQR1_SQ10_Pos)                 /*!< 0x00000100 */
#define ADC_SEQR1_SQ10_1          (0x2UL << ADC_SEQR1_SQ10_Pos)                 /*!< 0x00000200 */
#define ADC_SEQR1_SQ10_2          (0x4UL << ADC_SEQR1_SQ10_Pos)                 /*!< 0x00000400 */
#define ADC_SEQR1_SQ10_4          (0x8UL << ADC_SEQR1_SQ10_Pos)                 /*!< 0x00000800 */
#define ADC_SEQR1_SQ11_Pos        (12U)
#define ADC_SEQR1_SQ11_Msk        (0xFUL << ADC_SEQR1_SQ11_Pos)                 /*!< 0x0000F000 */
#define ADC_SEQR1_SQ11             ADC_SEQR1_SQ11_Msk                           /*!< ADC sequence select */
#define ADC_SEQR1_SQ11_0          (0x1UL << ADC_SEQR1_SQ11_Pos)                 /*!< 0x00001000 */
#define ADC_SEQR1_SQ11_1          (0x2UL << ADC_SEQR1_SQ11_Pos)                 /*!< 0x00002000 */
#define ADC_SEQR1_SQ11_2          (0x4UL << ADC_SEQR1_SQ11_Pos)                 /*!< 0x00004000 */
#define ADC_SEQR1_SQ11_4          (0x8UL << ADC_SEQR1_SQ11_Pos)                 /*!< 0x00008000 */
#define ADC_SEQR1_SQ12_Pos        (16U)
#define ADC_SEQR1_SQ12_Msk        (0xFUL << ADC_SEQR1_SQ12_Pos)                 /*!< 0x000F0000 */
#define ADC_SEQR1_SQ12             ADC_SEQR1_SQ12_Msk                           /*!< ADC sequence select */
#define ADC_SEQR1_SQ12_0          (0x1UL << ADC_SEQR1_SQ12_Pos)                 /*!< 0x00010000 */
#define ADC_SEQR1_SQ12_1          (0x2UL << ADC_SEQR1_SQ12_Pos)                 /*!< 0x00020000 */
#define ADC_SEQR1_SQ12_2          (0x4UL << ADC_SEQR1_SQ12_Pos)                 /*!< 0x00040000 */
#define ADC_SEQR1_SQ12_4          (0x8UL << ADC_SEQR1_SQ12_Pos)                 /*!< 0x00080000 */
#define ADC_SEQR1_SQ13_Pos        (20U)
#define ADC_SEQR1_SQ13_Msk        (0xFUL << ADC_SEQR1_SQ13_Pos)                 /*!< 0x00F00000 */
#define ADC_SEQR1_SQ13             ADC_SEQR1_SQ13_Msk                           /*!< ADC sequence select */
#define ADC_SEQR1_SQ13_0          (0x1UL << ADC_SEQR1_SQ13_Pos)                 /*!< 0x00100000 */
#define ADC_SEQR1_SQ13_1          (0x2UL << ADC_SEQR1_SQ13_Pos)                 /*!< 0x00200000 */
#define ADC_SEQR1_SQ13_2          (0x4UL << ADC_SEQR1_SQ13_Pos)                 /*!< 0x00400000 */
#define ADC_SEQR1_SQ13_4          (0x8UL << ADC_SEQR1_SQ13_Pos)                 /*!< 0x00800000 */
#define ADC_SEQR1_SQ14_Pos        (24U)
#define ADC_SEQR1_SQ14_Msk        (0xFUL << ADC_SEQR1_SQ14_Pos)                 /*!< 0x0F000000 */
#define ADC_SEQR1_SQ14             ADC_SEQR1_SQ14_Msk                           /*!< ADC sequence select */
#define ADC_SEQR1_SQ14_0          (0x1UL << ADC_SEQR1_SQ14_Pos)                 /*!< 0x01000000 */
#define ADC_SEQR1_SQ14_1          (0x2UL << ADC_SEQR1_SQ14_Pos)                 /*!< 0x02000000 */
#define ADC_SEQR1_SQ14_2          (0x4UL << ADC_SEQR1_SQ14_Pos)                 /*!< 0x04000000 */
#define ADC_SEQR1_SQ14_4          (0x8UL << ADC_SEQR1_SQ14_Pos)                 /*!< 0x08000000 */

/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA_Pos           (0U)
#define ADC_DR_DATA_Msk           (0xFFFFUL << ADC_DR_DATA_Pos)                 /*!< 0x0000FFFF */
#define ADC_DR_DATA                ADC_DR_DATA_Msk                              /*!< ADC group regular conversion data */
#define ADC_DR_DATA_0             (0x0001UL << ADC_DR_DATA_Pos)                 /*!< 0x00000001 */
#define ADC_DR_DATA_1             (0x0002UL << ADC_DR_DATA_Pos)                 /*!< 0x00000002 */
#define ADC_DR_DATA_2             (0x0004UL << ADC_DR_DATA_Pos)                 /*!< 0x00000004 */
#define ADC_DR_DATA_3             (0x0008UL << ADC_DR_DATA_Pos)                 /*!< 0x00000008 */
#define ADC_DR_DATA_4             (0x0010UL << ADC_DR_DATA_Pos)                 /*!< 0x00000010 */
#define ADC_DR_DATA_5             (0x0020UL << ADC_DR_DATA_Pos)                 /*!< 0x00000020 */
#define ADC_DR_DATA_6             (0x0040UL << ADC_DR_DATA_Pos)                 /*!< 0x00000040 */
#define ADC_DR_DATA_7             (0x0080UL << ADC_DR_DATA_Pos)                 /*!< 0x00000080 */
#define ADC_DR_DATA_8             (0x0100UL << ADC_DR_DATA_Pos)                 /*!< 0x00000100 */
#define ADC_DR_DATA_9             (0x0200UL << ADC_DR_DATA_Pos)                 /*!< 0x00000200 */
#define ADC_DR_DATA_10            (0x0400UL << ADC_DR_DATA_Pos)                 /*!< 0x00000400 */
#define ADC_DR_DATA_11            (0x0800UL << ADC_DR_DATA_Pos)                 /*!< 0x00000800 */
#define ADC_DR_DATA_12            (0x1000UL << ADC_DR_DATA_Pos)                 /*!< 0x00001000 */
#define ADC_DR_DATA_13            (0x2000UL << ADC_DR_DATA_Pos)                 /*!< 0x00002000 */
#define ADC_DR_DATA_14            (0x4000UL << ADC_DR_DATA_Pos)                 /*!< 0x00004000 */
#define ADC_DR_DATA_15            (0x8000UL << ADC_DR_DATA_Pos)                 /*!< 0x00008000 */

/********************  Bit definition for ADC_CCSR register  ********************/
#define ADC_CCSR_CALSEL_Pos       (11U)
#define ADC_CCSR_CALSEL_Msk       (0x1UL << ADC_CCSR_CALSEL_Pos)                /*!< 0x00000800 */
#define ADC_CCSR_CALSEL            ADC_CCSR_CALSEL_Msk                          /*!< ADC calibration context selection */
#define ADC_CCSR_CALSMP_Pos       (12U)
#define ADC_CCSR_CALSMP_Msk       (0x3UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00003000 */
#define ADC_CCSR_CALSMP            ADC_CCSR_CALSMP_Msk                          /*!< ADC calibration sample time selection */
#define ADC_CCSR_CALSMP_0         (0x1UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00001000 */
#define ADC_CCSR_CALSMP_1         (0x2UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00002000 */
#define ADC_CCSR_CALBYP_Pos       (14U)
#define ADC_CCSR_CALBYP_Msk       (0x1UL << ADC_CCSR_CALBYP_Pos)                /*!< 0x00000400 */
#define ADC_CCSR_CALBYP            ADC_CCSR_CALBYP_Msk                          /*!< ADC calibration context selection */
#define ADC_CCSR_CALSET_Pos       (15U)
#define ADC_CCSR_CALSET_Msk       (0x1UL << ADC_CCSR_CALSET_Pos)                /*!< 0x00000800 */
#define ADC_CCSR_CALSET            ADC_CCSR_CALSET_Msk                          /*!< ADC calibration context selection */
#define ADC_CCSR_OFFSUC_Pos       (29U)
#define ADC_CCSR_OFFSUC_Msk       (0x1UL << ADC_CCSR_OFFSUC_Pos)                /*!< 0x20000000 */
#define ADC_CCSR_OFFSUC            ADC_CCSR_OFFSUC_Msk                          /*!< ADC offset calibration status flag */
#define ADC_CCSR_CAPSUC_Pos       (30U)
#define ADC_CCSR_CAPSUC_Msk       (0x1UL << ADC_CCSR_CAPSUC_Pos)                /*!< 0x40000000 */
#define ADC_CCSR_CAPSUC            ADC_CCSR_CAPSUC_Msk                          /*!< ADC cap calibration status flag */
#define ADC_CCSR_CALON_Pos        (31U)
#define ADC_CCSR_CALON_Msk        (0x1UL << ADC_CCSR_CALON_Pos)                 /*!< 0x80000000 */
#define ADC_CCSR_CALON             ADC_CCSR_CALON_Msk                           /*!< ADC calibration flag */

/*************************  ADC Common registers  *****************************/
/*******************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_VREFEN_Pos        (22U)
#define ADC_CCR_VREFEN_Msk        (0x1UL << ADC_CCR_VREFEN_Pos)                 /*!< 0x00400000 */
#define ADC_CCR_VREFEN             ADC_CCR_VREFEN_Msk                           /*!< ADC internal path to VrefInt enable */
#define ADC_CCR_TSEN_Pos          (23U)
#define ADC_CCR_TSEN_Msk          (0x1UL << ADC_CCR_TSEN_Pos)                   /*!< 0x00800000 */
#define ADC_CCR_TSEN               ADC_CCR_TSEN_Msk                             /*!< ADC internal path to temperature sensor enable */


/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit (CRC)                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos            (0U)
#define CRC_DR_DR_Msk            (0xFFFFFFFFUL << CRC_DR_DR_Pos)                /*!< 0xFFFFFFFF */
#define CRC_DR_DR                CRC_DR_DR_Msk                                  /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos          (0U)
#define CRC_IDR_IDR_Msk          (0xFFUL << CRC_IDR_IDR_Pos)                  /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR              CRC_IDR_IDR_Msk                              /*!< General-purpose 8-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos         (0U)
#define CRC_CR_RESET_Msk         (0x1UL << CRC_CR_RESET_Pos)                    /*!< 0x00000001 */
#define CRC_CR_RESET             CRC_CR_RESET_Msk                               /*!< RESET the CRC computation unit bit */

/******************************************************************************/
/*                                                                            */
/*                                Debug MCU (DBGMCU)                          */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DBG_IDCODE register  *************/
#define DBGMCU_IDCODE_DEV_ID_Pos                          (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk                          (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos)  /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                              DBGMCU_IDCODE_DEV_ID_Msk
#define DBGMCU_IDCODE_REV_ID_Pos                          (16U)
#define DBGMCU_IDCODE_REV_ID_Msk                          (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID                              DBGMCU_IDCODE_REV_ID_Msk

/********************  Bit definition for DBGMCU_CR register  *****************/
#define DBGMCU_CR_DBG_SLEEP_Pos                           (0U)
#define DBGMCU_CR_DBG_SLEEP_Msk                           (0x1UL << DBGMCU_CR_DBG_SLEEP_Pos)     /*!< 0x00000001 */
#define DBGMCU_CR_DBG_SLEEP                               DBGMCU_CR_DBG_SLEEP_Msk

#define DBGMCU_CR_DBG_STOP_Pos                            (1U)
#define DBGMCU_CR_DBG_STOP_Msk                            (0x1UL << DBGMCU_CR_DBG_STOP_Pos)      /*!< 0x00000002 */
#define DBGMCU_CR_DBG_STOP                                DBGMCU_CR_DBG_STOP_Msk

/********************  Bit definition for DBGMCU_APB_FZ1 register  ***********/
#define DBGMCU_APB_FZ1_DBG_TIM2_STOP_Pos                  (0U)
#define DBGMCU_APB_FZ1_DBG_TIM2_STOP_Msk                  (0x1UL << DBGMCU_APB_FZ1_DBG_TIM2_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_APB_FZ1_DBG_TIM2_STOP                      DBGMCU_APB_FZ1_DBG_TIM2_STOP_Msk
#define DBGMCU_APB_FZ1_DBG_RTC_STOP_Pos                   (10U)
#define DBGMCU_APB_FZ1_DBG_RTC_STOP_Msk                   (0x1UL << DBGMCU_APB_FZ1_DBG_RTC_STOP_Pos)  /*!< 0x00000400 */
#define DBGMCU_APB_FZ1_DBG_RTC_STOP                       DBGMCU_APB_FZ1_DBG_RTC_STOP_Msk
#define DBGMCU_APB_FZ1_DBG_WWDG_STOP_Pos                  (11U)
#define DBGMCU_APB_FZ1_DBG_WWDG_STOP_Msk                  (0x1UL << DBGMCU_APB_FZ1_DBG_WWDG_STOP_Pos) /*!< 0x00000800 */
#define DBGMCU_APB_FZ1_DBG_WWDG_STOP                      DBGMCU_APB_FZ1_DBG_WWDG_STOP_Msk
#define DBGMCU_APB_FZ1_DBG_IWDG_STOP_Pos                  (12U)
#define DBGMCU_APB_FZ1_DBG_IWDG_STOP_Msk                  (0x1UL << DBGMCU_APB_FZ1_DBG_IWDG_STOP_Pos) /*!< 0x00001000 */
#define DBGMCU_APB_FZ1_DBG_IWDG_STOP                      DBGMCU_APB_FZ1_DBG_IWDG_STOP_Msk
#define DBGMCU_APB_FZ1_DBG_LPTIM_STOP_Pos                 (31U)
#define DBGMCU_APB_FZ1_DBG_LPTIM_STOP_Msk                 (0x1UL << DBGMCU_APB_FZ1_DBG_LPTIM_STOP_Pos) /*!< 0x00001000 */
#define DBGMCU_APB_FZ1_DBG_LPTIM_STOP                     DBGMCU_APB_FZ1_DBG_LPTIM_STOP_Msk

/********************  Bit definition for DBGMCU_APB_FZ2 register  ************/
#define DBGMCU_APB_FZ2_DBG_TIM1_STOP_Pos                  (11U)
#define DBGMCU_APB_FZ2_DBG_TIM1_STOP_Msk                  (0x1UL << DBGMCU_APB_FZ2_DBG_TIM1_STOP_Pos)  /*!< 0x00000800 */
#define DBGMCU_APB_FZ2_DBG_TIM1_STOP                      DBGMCU_APB_FZ2_DBG_TIM1_STOP_Msk
#define DBGMCU_APB_FZ2_DBG_TIM14_STOP_Pos                 (15U)
#define DBGMCU_APB_FZ2_DBG_TIM14_STOP_Msk                 (0x1UL << DBGMCU_APB_FZ2_DBG_TIM14_STOP_Pos) /*!< 0x00008000 */
#define DBGMCU_APB_FZ2_DBG_TIM14_STOP                     DBGMCU_APB_FZ2_DBG_TIM14_STOP_Msk
#define DBGMCU_APB_FZ2_DBG_TIM16_STOP_Pos                 (17U)
#define DBGMCU_APB_FZ2_DBG_TIM16_STOP_Msk                 (0x1UL << DBGMCU_APB_FZ2_DBG_TIM16_STOP_Pos) /*!< 0x00020000 */
#define DBGMCU_APB_FZ2_DBG_TIM16_STOP                     DBGMCU_APB_FZ2_DBG_TIM16_STOP_Msk
#define DBGMCU_APB_FZ2_DBG_TIM17_STOP_Pos                 (18U)
#define DBGMCU_APB_FZ2_DBG_TIM17_STOP_Msk                 (0x1UL << DBGMCU_APB_FZ2_DBG_TIM17_STOP_Pos) /*!< 0x00040000 */
#define DBGMCU_APB_FZ2_DBG_TIM17_STOP                     DBGMCU_APB_FZ2_DBG_TIM17_STOP_Msk


/******************************************************************************/
/*                                                                            */
/*                           DMA Controller (DMA)                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for DMA_ISR register  ********************/
#define DMA_ISR_GIF1_Pos       (0U)
#define DMA_ISR_GIF1_Msk       (0x1UL << DMA_ISR_GIF1_Pos)                     /*!< 0x00000001 */
#define DMA_ISR_GIF1           DMA_ISR_GIF1_Msk                                /*!< Channel 1 Global interrupt flag */
#define DMA_ISR_TCIF1_Pos      (1U)
#define DMA_ISR_TCIF1_Msk      (0x1UL << DMA_ISR_TCIF1_Pos)                    /*!< 0x00000002 */
#define DMA_ISR_TCIF1          DMA_ISR_TCIF1_Msk                               /*!< Channel 1 Transfer Complete flag */
#define DMA_ISR_HTIF1_Pos      (2U)
#define DMA_ISR_HTIF1_Msk      (0x1UL << DMA_ISR_HTIF1_Pos)                    /*!< 0x00000004 */
#define DMA_ISR_HTIF1          DMA_ISR_HTIF1_Msk                               /*!< Channel 1 Half Transfer flag */
#define DMA_ISR_TEIF1_Pos      (3U)
#define DMA_ISR_TEIF1_Msk      (0x1UL << DMA_ISR_TEIF1_Pos)                    /*!< 0x00000008 */
#define DMA_ISR_TEIF1          DMA_ISR_TEIF1_Msk                               /*!< Channel 1 Transfer Error flag */
#define DMA_ISR_GIF2_Pos       (4U)
#define DMA_ISR_GIF2_Msk       (0x1UL << DMA_ISR_GIF2_Pos)                     /*!< 0x00000010 */
#define DMA_ISR_GIF2           DMA_ISR_GIF2_Msk                                /*!< Channel 2 Global interrupt flag */
#define DMA_ISR_TCIF2_Pos      (5U)
#define DMA_ISR_TCIF2_Msk      (0x1UL << DMA_ISR_TCIF2_Pos)                    /*!< 0x00000020 */
#define DMA_ISR_TCIF2          DMA_ISR_TCIF2_Msk                               /*!< Channel 2 Transfer Complete flag */
#define DMA_ISR_HTIF2_Pos      (6U)
#define DMA_ISR_HTIF2_Msk      (0x1UL << DMA_ISR_HTIF2_Pos)                    /*!< 0x00000040 */
#define DMA_ISR_HTIF2          DMA_ISR_HTIF2_Msk                               /*!< Channel 2 Half Transfer flag */
#define DMA_ISR_TEIF2_Pos      (7U)
#define DMA_ISR_TEIF2_Msk      (0x1UL << DMA_ISR_TEIF2_Pos)                    /*!< 0x00000080 */
#define DMA_ISR_TEIF2          DMA_ISR_TEIF2_Msk                               /*!< Channel 2 Transfer Error flag */
#define DMA_ISR_GIF3_Pos       (8U)
#define DMA_ISR_GIF3_Msk       (0x1UL << DMA_ISR_GIF3_Pos)                     /*!< 0x00000100 */
#define DMA_ISR_GIF3           DMA_ISR_GIF3_Msk                                /*!< Channel 3 Global interrupt flag */
#define DMA_ISR_TCIF3_Pos      (9U)
#define DMA_ISR_TCIF3_Msk      (0x1UL << DMA_ISR_TCIF3_Pos)                    /*!< 0x00000200 */
#define DMA_ISR_TCIF3          DMA_ISR_TCIF3_Msk                               /*!< Channel 3 Transfer Complete flag */
#define DMA_ISR_HTIF3_Pos      (10U)
#define DMA_ISR_HTIF3_Msk      (0x1UL << DMA_ISR_HTIF3_Pos)                    /*!< 0x00000400 */
#define DMA_ISR_HTIF3          DMA_ISR_HTIF3_Msk                               /*!< Channel 3 Half Transfer flag */
#define DMA_ISR_TEIF3_Pos      (11U)
#define DMA_ISR_TEIF3_Msk      (0x1UL << DMA_ISR_TEIF3_Pos)                    /*!< 0x00000800 */
#define DMA_ISR_TEIF3          DMA_ISR_TEIF3_Msk                               /*!< Channel 3 Transfer Error flag */

