OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x7.h
#define SYSCFG_CFGR3_DMA3_MAP_Pos                  (16U)
#define SYSCFG_CFGR3_DMA3_MAP_Msk                  (0x3FUL << SYSCFG_CFGR3_DMA3_MAP_Pos)   /*!< 0x003F0000 */
#define SYSCFG_CFGR3_DMA3_MAP                      SYSCFG_CFGR3_DMA3_MAP_Msk
#define SYSCFG_CFGR3_DMA3_MAP_0                    (0x1UL << SYSCFG_CFGR3_DMA3_MAP_Pos)    /*!< 0x00010000 */
#define SYSCFG_CFGR3_DMA3_MAP_1                    (0x2UL << SYSCFG_CFGR3_DMA3_MAP_Pos)    /*!< 0x00020000 */
#define SYSCFG_CFGR3_DMA3_MAP_2                    (0x4UL << SYSCFG_CFGR3_DMA3_MAP_Pos)    /*!< 0x00040000 */
#define SYSCFG_CFGR3_DMA3_MAP_3                    (0x8UL << SYSCFG_CFGR3_DMA3_MAP_Pos)    /*!< 0x000800000 */
#define SYSCFG_CFGR3_DMA3_MAP_4                    (0x10UL << SYSCFG_CFGR3_DMA3_MAP_Pos)   /*!< 0x00100000 */
#define SYSCFG_CFGR3_DMA3_MAP_5                    (0x20UL << SYSCFG_CFGR3_DMA3_MAP_Pos)   /*!< 0x00200000 */

/*****************  Bit definition for PA_ENS register  **********************/
#define SYSCFG_GPIO_ENS_PA_ENS_Pos                 (0U)
#define SYSCFG_GPIO_ENS_PA_ENS_Msk                 (0xFFFFUL << SYSCFG_GPIO_ENS_PA_ENS_Pos)           /*!< 0x0000FFFF */
#define SYSCFG_GPIO_ENS_PA_ENS                     SYSCFG_GPIO_ENS_PA_ENS_Msk                         /*!< PA_ENS[15:0] bits */

/*****************  Bit definition for PB_ENS register  **********************/
#define SYSCFG_GPIO_ENS_PB_ENS_Pos                 (0U)
#define SYSCFG_GPIO_ENS_PB_ENS_Msk                 (0xFFFFUL << SYSCFG_GPIO_ENS_PB_ENS_Pos)           /*!< 0x0000FFFF */
#define SYSCFG_GPIO_ENS_PB_ENS                     SYSCFG_GPIO_ENS_PB_ENS_Msk                         /*!< PB_ENS[15:0] bits */

/*****************  Bit definition for PF_ENS register  **********************/
#define SYSCFG_GPIO_ENS_PF_ENS_Pos                 (0U)
#define SYSCFG_GPIO_ENS_PF_ENS_Msk                 (0xFFFUL << SYSCFG_GPIO_ENS_PF_ENS_Pos)            /*!< 0x00030000 */
#define SYSCFG_GPIO_ENS_PF_ENS                     SYSCFG_GPIO_ENS_PF_ENS_Msk                         /*!< PF_ENS[11:0] bits */

/*****************  Bit definition for SYSCFG_IOCFG register  **********************/
#define SYSCFG_IOCFG_PA_EIIC_Pos                   (0U)
#define SYSCFG_IOCFG_PA_EIIC_Msk                   (0xFFUL << SYSCFG_IOCFG_PA_EIIC_Pos)               /*!< 0x000000FF */
#define SYSCFG_IOCFG_PA_EIIC                       SYSCFG_IOCFG_PA_EIIC_Msk                           /*!< PA_EIIC[7:0] bits */
#define SYSCFG_IOCFG_PA_EIIC_0                     (0x1UL << SYSCFG_IOCFG_PA_EIIC_Pos)                /*!< 0x00000001 */
#define SYSCFG_IOCFG_PA_EIIC_1                     (0x2UL << SYSCFG_IOCFG_PA_EIIC_Pos)                /*!< 0x00000002 */
#define SYSCFG_IOCFG_PA_EIIC_2                     (0x4UL << SYSCFG_IOCFG_PA_EIIC_Pos)                /*!< 0x00000004 */
#define SYSCFG_IOCFG_PA_EIIC_3                     (0x8UL << SYSCFG_IOCFG_PA_EIIC_Pos)                /*!< 0x00000008 */
#define SYSCFG_IOCFG_PA_EIIC_4                     (0x10UL << SYSCFG_IOCFG_PA_EIIC_Pos)               /*!< 0x00000010 */
#define SYSCFG_IOCFG_PA_EIIC_5                     (0x20UL << SYSCFG_IOCFG_PA_EIIC_Pos)               /*!< 0x00000020 */
#define SYSCFG_IOCFG_PA_EIIC_6                     (0x40UL << SYSCFG_IOCFG_PA_EIIC_Pos)               /*!< 0x00000040 */
#define SYSCFG_IOCFG_PA_EIIC_7                     (0x80UL << SYSCFG_IOCFG_PA_EIIC_Pos)               /*!< 0x00000080 */

#define SYSCFG_IOCFG_PB_EIIC_Pos                   (8U)
#define SYSCFG_IOCFG_PB_EIIC_Msk                   (0x1FUL << SYSCFG_IOCFG_PB_EIIC_Pos)               /*!< 0x00030000 */
#define SYSCFG_IOCFG_PB_EIIC                       SYSCFG_IOCFG_PB_EIIC_Msk                           /*!< PB_EIIC[4:0] bits */
#define SYSCFG_IOCFG_PB_EIIC_0                     (0x1UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00000100 */
#define SYSCFG_IOCFG_PB_EIIC_1                     (0x2UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00000200 */
#define SYSCFG_IOCFG_PB_EIIC_2                     (0x4UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00000400 */
#define SYSCFG_IOCFG_PB_EIIC_3                     (0x8UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x00000800 */
#define SYSCFG_IOCFG_PB_EIIC_4                     (0x10UL << SYSCFG_IOCFG_PB_EIIC_Pos)               /*!< 0x00001000 */

#define SYSCFG_IOCFG_PA_EHS_Pos                    (13U)
#define SYSCFG_IOCFG_PA_EHS_Msk                    (0x3UL << SYSCFG_IOCFG_PA_EHS_Pos)                 /*!< 0x00006000 */
#define SYSCFG_IOCFG_PA_EHS                        SYSCFG_IOCFG_PA_EHS_Msk                            /*!< PA_EHS[1:0] bits */
#define SYSCFG_IOCFG_PA_EHS_0                      (0x1UL << SYSCFG_IOCFG_PA_EHS_Pos)                 /*!< 0x00002000 */
#define SYSCFG_IOCFG_PA_EHS_1                      (0x2UL << SYSCFG_IOCFG_PA_EHS_Pos)                 /*!< 0x00004000 */

#define SYSCFG_IOCFG_PB_EHS_Pos                    (16U)
#define SYSCFG_IOCFG_PB_EHS_Msk                    (0x3FUL << SYSCFG_IOCFG_PB_EHS_Pos)                /*!< 0x01F80000 */
#define SYSCFG_IOCFG_PB_EHS                        SYSCFG_IOCFG_PB_EHS_Msk                            /*!< PB_EHS[5:0] bits */
#define SYSCFG_IOCFG_PB_EHS_0                      (0x1UL << SYSCFG_IOCFG_PB_EHS_Pos)                 /*!< 0x00080000 */
#define SYSCFG_IOCFG_PB_EHS_1                      (0x2UL << SYSCFG_IOCFG_PB_EHS_Pos)                 /*!< 0x00100000 */
#define SYSCFG_IOCFG_PB_EHS_2                      (0x4UL << SYSCFG_IOCFG_PB_EHS_Pos)                 /*!< 0x00200000 */
#define SYSCFG_IOCFG_PB_EHS_3                      (0x8UL << SYSCFG_IOCFG_PB_EHS_Pos)                 /*!< 0x00400000 */
#define SYSCFG_IOCFG_PB_EHS_4                      (0x10UL << SYSCFG_IOCFG_PB_EHS_Pos)                /*!< 0x00800000 */
#define SYSCFG_IOCFG_PB_EHS_5                      (0x20UL << SYSCFG_IOCFG_PB_EHS_Pos)                /*!< 0x01000000 */

#define SYSCFG_IOCFG_PF_EIIC_Pos                   (24U)
#define SYSCFG_IOCFG_PF_EIIC_Msk                   (0xFUL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x0F000000 */
#define SYSCFG_IOCFG_PF_EIIC                       SYSCFG_IOCFG_PF_EIIC_Msk                           /*!< PF_EIIC[3:0] bits */
#define SYSCFG_IOCFG_PF_EIIC_0                     (0x1UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x01000000 */
#define SYSCFG_IOCFG_PF_EIIC_1                     (0x2UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x02000000 */
#define SYSCFG_IOCFG_PF_EIIC_2                     (0x4UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x04000000 */
#define SYSCFG_IOCFG_PF_EIIC_3                     (0x8UL << SYSCFG_IOCFG_PB_EIIC_Pos)                /*!< 0x08000000 */

