OpenPuya/PY32F0xx_Firmware/Templates/PY32F030xx_Templates_LL/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.0/Drivers/CMSIS/Device/Puya/PY32F0xx/Include/py32f031x7.h
#define COMP_CSR_PWRMODE_Pos        (18U)
#define COMP_CSR_PWRMODE_Msk        (0x3UL << COMP_CSR_PWRMODE_Pos)               /*!< 0x000C0000 */
#define COMP_CSR_PWRMODE            COMP_CSR_PWRMODE_Msk                          /*!< Comparator power mode */
#define COMP_CSR_PWRMODE_0          (0x1UL << COMP_CSR_PWRMODE_Pos)               /*!< 0x00040000 */
#define COMP_CSR_PWRMODE_1          (0x2UL << COMP_CSR_PWRMODE_Pos)               /*!< 0x00080000 */

#define COMP_CSR_VCDIV_Pos          (20U)
#define COMP_CSR_VCDIV_Msk          (0x3FUL << COMP_CSR_VCDIV_Pos)                /*!< 0x003F0000 */
#define COMP_CSR_VCDIV              COMP_CSR_VCDIV_Msk                            /*!< Comparator vcdiv */
#define COMP_CSR_VCDIV_0            (0x1UL << COMP_CSR_VCDIV_Pos)                 /*!< 0x00010000 */
#define COMP_CSR_VCDIV_1            (0x2UL << COMP_CSR_VCDIV_Pos)                 /*!< 0x00020000 */
#define COMP_CSR_VCDIV_2            (0x4UL << COMP_CSR_VCDIV_Pos)                 /*!< 0x00040000 */
#define COMP_CSR_VCDIV_3            (0x8UL << COMP_CSR_VCDIV_Pos)                 /*!< 0x00080000 */
#define COMP_CSR_VCDIV_4            (0x10UL << COMP_CSR_VCDIV_Pos)                /*!< 0x00100000 */
#define COMP_CSR_VCDIV_5            (0x20UL << COMP_CSR_VCDIV_Pos)                /*!< 0x00200000 */

#define COMP_CSR_VCDIV_EN_Pos       (26U)
#define COMP_CSR_VCDIV_EN_Msk       (0x1UL << COMP_CSR_VCDIV_EN_Pos)              /*!< 0x04000000 */
#define COMP_CSR_VCDIV_EN           COMP_CSR_VCDIV_EN_Msk                         /*!< Comparator vcdiv en */

#define COMP_CSR_VCSEL_Pos          (27U)
#define COMP_CSR_VCSEL_Msk          (0x1UL << COMP_CSR_VCSEL_Pos)                 /*!< 0x08000000 */
#define COMP_CSR_VCSEL              COMP_CSR_VCSEL_Msk                            /*!< Comparator vcsel */

#define COMP_CSR_COMP_OUT_Pos       (30U)
#define COMP_CSR_COMP_OUT_Msk       (0x1UL << COMP_CSR_COMP_OUT_Pos)              /*!< 0x40000000 */
#define COMP_CSR_COMP_OUT           COMP_CSR_COMP_OUT_Msk

#define COMP_CSR_LOCK_Pos           (31U)
#define COMP_CSR_LOCK_Msk           (0x1UL << COMP_CSR_LOCK_Pos)                  /*!< 0x80000000 */
#define COMP_CSR_LOCK               COMP_CSR_LOCK_Msk                             /*!< Comparator lock */

/**********************  Bit definition for COMP_FR register  ****************/
#define COMP_FR_FLTEN_Pos             (0U)
#define COMP_FR_FLTEN_Msk             (0x1UL << COMP_FR_FLTEN_Pos)                /*!< 0x00000001 */
#define COMP_FR_FLTEN                 COMP_FR_FLTEN_Msk                           /*!< Comparator filter enable */
#define COMP_FR_FLTCNT_Pos            (16U)
#define COMP_FR_FLTCNT_Msk            (0xFFFFUL << COMP_FR_FLTCNT_Pos)            /*!< 0xFFFF0000 */
#define COMP_FR_FLTCNT                COMP_FR_FLTCNT_Msk                          /*!< Comparator filter counter */

/******************************************************************************/
/*                                                                            */
/*                      Operational amplifier (OPA)                           */
/*                                                                            */
/******************************************************************************/
/**********************  Bit definition for OPA_OENR register  ****************/
#define OPA_OENR_OPA1OEN_Pos            (1U)
#define OPA_OENR_OPA1OEN_Msk            (0x1UL << OPA_OENR_OPA1OEN_Pos)                 /*!< 0x00000002 */
#define OPA_OENR_OPA1OEN                OPA_OENR_OPA1OEN_Msk                            /*!< OPA1 output enable */
#define OPA_OENR_OPA2OEN_Pos            (6U)
#define OPA_OENR_OPA2OEN_Msk            (0x1UL << OPA_OENR_OPA2OEN_Pos)                 /*!< 0x00000040 */
#define OPA_OENR_OPA2OEN                OPA_OENR_OPA2OEN_Msk                            /*!< OPA2 output enable */

/**********************  Bit definition for OPA_CR register  ****************/
#define OPA_CR_OPA1EN_Pos             (5U)
#define OPA_CR_OPA1EN_Msk             (0x1UL << OPA_CR_OPA1EN_Pos)                      /*!< 0x00000020 */
#define OPA_CR_OPA1EN                 OPA_CR_OPA1EN_Msk                                 /*!< OPA1 enable */
#define OPA_CR_OPA2EN_Pos             (6U)
#define OPA_CR_OPA2EN_Msk             (0x1UL << OPA_CR_OPA2EN_Pos)                      /*!< 0x00000040 */
#define OPA_CR_OPA2EN                 OPA_CR_OPA2EN_Msk                                 /*!< OPA2 enable */

/******************************************************************************/
/*                                                                            */
/*                      Digital Co-process Operation (CORDIC)                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CORDIC_CR register  *********************/
#define CORDIC_CR_ITERATION_Pos                 (0U)
#define CORDIC_CR_ITERATION_Msk                 (0x1FUL << CORDIC_CR_ITERATION_Pos)
#define CORDIC_CR_ITERATION                     CORDIC_CR_ITERATION_Msk

#define CORDIC_CR_CORDIC_INT_Pos                (5U)
#define CORDIC_CR_CORDIC_INT_Msk                (0x1UL << CORDIC_CR_CORDIC_INT_Pos)
#define CORDIC_CR_CORDIC_INT                    CORDIC_CR_CORDIC_INT_Msk

#define CORDIC_CR_SQRT_INT_Pos                  (6U)
#define CORDIC_CR_SQRT_INT_Msk                  (0x1UL << CORDIC_CR_SQRT_INT_Pos)
#define CORDIC_CR_SQRT_INT                      CORDIC_CR_SQRT_INT_Msk

#define CORDIC_CR_CORDIC_MODE_Pos               (7U)
#define CORDIC_CR_CORDIC_MODE_Msk               (0x1UL << CORDIC_CR_CORDIC_MODE_Pos)
#define CORDIC_CR_CORDIC_MODE                   CORDIC_CR_CORDIC_MODE_Msk

#define CORDIC_CR_START_Pos                     (8U)
#define CORDIC_CR_START_Msk                     (0x1UL << CORDIC_CR_START_Pos)
#define CORDIC_CR_START                         CORDIC_CR_START_Msk

